{
  "terms": [
    {
      "term": "Phishing",
      "definition": "An attempt to trick individuals into revealing sensitive information through fraudulent emails, websites, or messages."
    },
    {
      "term": "Phishing Email",
      "definition": "An email sent by attackers that appears legitimate but aims to trick recipients into revealing sensitive information or performing actions."
    },
    {
      "term": "Social Engineering Toolkit (SET)",
      "definition": "A framework for simulating social engineering attacks, helping organizations test their security awareness."
    },
    {
      "term": "Advanced Persistent Threat (APT)",
      "definition": "A prolonged and targeted cyber attack in which attackers gain and maintain unauthorized access to a network."
    },
    {
      "term": "Cyber Espionage",
      "definition": "The use of cyber techniques to steal sensitive information from governments, organizations, or individuals."
    },
    {
      "term": "Zero-Knowledge Proof",
      "definition": "A cryptographic method that allows a party to prove knowledge of a secret without revealing the secret itself."
    },
    {
      "term": "Security Operations Center (SOC)",
      "definition": "A centralized unit that monitors, detects, and responds to cybersecurity incidents and threats in real-time."
    },
    {
      "term": "Data Loss Prevention (DLP)",
      "definition": "A strategy and set of tools to prevent the unauthorized loss or leakage of sensitive data."
    },
    {
      "term": "Endpoint Security",
      "definition": "The protection of devices like laptops, desktops, and smartphones from various security threats."
    },
    {
      "term": "Security Token",
      "definition": "A physical or digital device used to authenticate users or provide one-time passwords for secure access."
    },
    {
      "term": "Network Security",
      "definition": "The protection of network infrastructure and data from unauthorized access or attacks."
    },
    {
      "term": "Payload",
      "definition": "The part of a malware or exploit that performs malicious actions on a victim's system."
    },
    {
      "term": "Cryptography",
      "definition": "The practice of secure communication by converting plaintext into ciphertext and vice versa."
    },
    {
      "term": "Social Engineering Attack Vectors",
      "definition": "Different methods and techniques used in social engineering attacks to manipulate victims."
    },
    {
      "term": "Threat Hunting",
      "definition": "Proactively searching for and identifying cyber threats that have evaded traditional security measures."
    },
    {
      "term": "Incident Response",
      "definition": "The process of managing and mitigating the impact of a cybersecurity incident or breach."
    },
    {
      "term": "Privilege Escalation",
      "definition": "The act of gaining higher levels of access or permissions in a system or network than originally granted."
    },
    {
      "term": "Security Assessment",
      "definition": "A systematic evaluation of an organization's security measures to identify vulnerabilities and weaknesses."
    },
    {
      "term": "Data Encryption Standard (DES)",
      "definition": "An early symmetric key encryption algorithm used to secure electronic data."
    },
    {
      "term": "Advanced Encryption Standard (AES)",
      "definition": "A widely used symmetric key encryption algorithm known for its security and efficiency."
    },
    {
      "term": "Public Key Infrastructure (PKI)",
      "definition": "A system for managing digital certificates and public-private key pairs used in asymmetric encryption."
    },
    {
      "term": "Certificate Authority (CA)",
      "definition": "An entity responsible for issuing and managing digital certificates used in PKI."
    },
    {
      "term": "Secure Sockets Layer (SSL)",
      "definition": "An older cryptographic protocol that provides secure communication over a computer network."
    },
    {
      "term": "Transport Layer Security (TLS)",
      "definition": "A more secure successor to SSL, providing encryption and authentication for secure communication."
    },
    {
      "term": "Key Exchange",
      "definition": "The process of securely sharing encryption keys between parties to establish a secure communication channel."
    },
    {
      "term": "Malvertising",
      "definition": "Malicious online advertisements that deliver malware or lead to malicious websites."
    },
    {
      "term": "Eavesdropping",
      "definition": "Unauthorized interception and monitoring of private communications, often done surreptitiously."
    },
    {
      "term": "Identity Theft",
      "definition": "The fraudulent acquisition and use of an individual's personal information to impersonate them for malicious purposes."
    },
    {
      "term": "Zero-Day Vulnerability",
      "definition": "A software vulnerability that is not yet known to the vendor or the public, making it highly valuable to attackers."
    },
    {
      "term": "Security Patch",
      "definition": "An update released by software vendors to fix security vulnerabilities in their products."
    },
    {
      "term": "Cross-Site Scripting (XSS)",
      "definition": "A type of web vulnerability where attackers inject malicious scripts into web pages viewed by other users."
    },
    {
      "term": "Cross-Site Request Forgery (CSRF)",
      "definition": "An attack that tricks a user into unknowingly submitting a malicious request on a trusted website."
    },
    {
      "term": "Phishing Email",
      "definition": "An email sent by attackers that appears legitimate but aims to trick recipients into revealing sensitive information or performing actions."
    },
    {
      "term": "Access Token",
      "definition": "A credential issued by an authorization server that allows a client to access protected resources.",
      "tags": [
        "IAM"
      ]
    },
    {
      "term": "Attribute-Based Access Control (ABAC)",
      "definition": "An access control model that grants permissions based on attributes of users, resources, and environment.",
      "tags": [
        "IAM"
      ]
    },
    {
      "term": "Authorization Code Grant",
      "definition": "An OAuth 2.0 flow where an authorization code is exchanged for an access token via the client’s backend.",
      "tags": [
        "IAM"
      ]
    },
    {
      "term": "Client Credentials Grant",
      "definition": "An OAuth 2.0 flow where a client application uses its own credentials to obtain an access token.",
      "tags": [
        "IAM"
      ]
    },
    {
      "term": "Conditional Access",
      "definition": "A policy-based approach to enforce specific access requirements based on user, device, or location signals.",
      "tags": [
        "IAM"
      ]
    },
    {
      "term": "Deprovisioning",
      "definition": "The removal of user accounts and access rights when they are no longer needed.",
      "tags": [
        "IAM"
      ]
    },
    {
      "term": "Device Code Flow",
      "definition": "An OAuth 2.0 flow designed for devices with limited input capabilities, using a user code and verification URL.",
      "tags": [
        "IAM"
      ]
    },
    {
      "term": "Federated Identity",
      "definition": "A system that enables users to use the same identity across multiple organizations or domains.",
      "tags": [
        "IAM"
      ]
    },
    {
      "term": "Identity Governance and Administration (IGA)",
      "definition": "Processes and technologies for managing digital identities and access rights across an organization.",
      "tags": [
        "IAM"
      ]
    },
    {
      "term": "Identity Provider (IdP)",
      "definition": "A service that creates, maintains, and manages identity information and provides authentication services.",
      "tags": [
        "IAM"
      ]
    },
    {
      "term": "Implicit Grant",
      "definition": "An OAuth 2.0 flow optimized for public clients where tokens are returned directly in the redirect URI.",
      "tags": [
        "IAM"
      ]
    },
    {
      "term": "JSON Web Token (JWT)",
      "definition": "A compact, URL-safe token format used to securely transmit claims between parties.",
      "tags": [
        "IAM"
      ]
    },
    {
      "term": "Just-in-Time Provisioning",
      "definition": "A provisioning approach that creates user accounts on demand during the first sign-in.",
      "tags": [
        "IAM"
      ]
    },
    {
      "term": "Least Privilege",
      "definition": "A principle that restricts users to the minimum level of access required to perform their tasks.",
      "tags": [
        "IAM"
      ]
    },
    {
      "term": "Multi-Factor Authentication (MFA)",
      "definition": "A security method that requires users to provide two or more verification factors to gain access.",
      "tags": [
        "IAM"
      ]
    },
    {
      "term": "OAuth 2.0",
      "definition": "An authorization framework that enables applications to obtain limited access to user accounts on HTTP services.",
      "tags": [
        "IAM"
      ]
    },
    {
      "term": "OpenID Connect (OIDC)",
      "definition": "An authentication layer built on OAuth 2.0 that allows clients to verify user identities.",
      "tags": [
        "IAM"
      ]
    },
    {
      "term": "Passwordless Authentication",
      "definition": "An authentication method that does not require users to remember or enter a password.",
      "tags": [
        "IAM"
      ]
    },
    {
      "term": "Proof Key for Code Exchange (PKCE)",
      "definition": "An extension to OAuth 2.0 that mitigates authorization code interception attacks using a dynamically generated secret.",
      "tags": [
        "IAM"
      ]
    },
    {
      "term": "Privileged Access Management (PAM)",
      "definition": "Tools and practices used to secure, control, and monitor access to critical systems by privileged users.",
      "tags": [
        "IAM"
      ]
    },
    {
      "term": "Refresh Token",
      "definition": "A long-lived credential used to obtain new access tokens without re-authenticating the user.",
      "tags": [
        "IAM"
      ]
    },
    {
      "term": "Resource Owner Password Credentials Grant",
      "definition": "An OAuth 2.0 flow where the user provides credentials directly to the client to obtain an access token.",
      "tags": [
        "IAM"
      ]
    },
    {
      "term": "Role-Based Access Control (RBAC)",
      "definition": "An access control model that assigns permissions to users based on their roles.",
      "tags": [
        "IAM"
      ]
    },
    {
      "term": "Single Sign-On (SSO)",
      "definition": "An authentication process that allows a user to access multiple applications with one set of login credentials.",
      "tags": [
        "IAM"
      ]
    },
    {
      "term": "Single Sign-Out",
      "definition": "A process that logs a user out of multiple applications simultaneously.",
      "tags": [
        "IAM"
      ]
    },
    {
      "term": "System for Cross-domain Identity Management (SCIM)",
      "definition": "An open standard for automating the exchange of user identity information between identity domains or IT systems.",
      "tags": [
        "IAM"
      ]
    },
    {
      "term": "Token Introspection",
      "definition": "An OAuth 2.0 endpoint that allows resource servers to validate and obtain metadata about a token.",
      "tags": [
        "IAM"
      ]
    },
    {
      "term": "User Provisioning",
      "definition": "The creation of user accounts and access rights in applications and systems.",
      "tags": [
        "IAM"
      ]
    }
  ]
}
