{
  "terms": [
    {
      "term": "CVE",
      "definition": "A public catalog of cybersecurity vulnerabilities providing unique identifiers for known software flaws."
    },
    {
      "term": "CWE",
      "definition": "A community-developed list of common software and hardware weakness types."
    },
    {
      "term": "CVSS",
      "definition": "A standardized scoring system for rating the severity of security vulnerabilities."
    },
    {
      "term": "NVD",
      "definition": "A U.S. government repository of standards-based vulnerability management data."
    },
    {
      "term": "MITRE ATT&CK",
      "definition": "A globally accessible knowledge base of adversary tactics and techniques based on real-world observations."
    },
    {
      "term": "OWASP Top 10",
      "definition": "A regularly updated report outlining the ten most critical web application security risks, published by the Open Web Application Security Project."
    },
    {
      "term": "SIEM",
      "definition": "A platform that aggregates and analyzes security telemetry from multiple log sources to support threat detection and incident response."
    },
    {
      "term": "EDR",
      "definition": "Security tooling focused on monitoring endpoints for malicious activity and providing response capabilities."
    },
    {
      "term": "Sigma",
      "definition": "An open detection rule format that allows analysts to describe suspicious behaviors in a SIEM-agnostic way."
    },
    {
      "term": "KQL",
      "definition": "A query language used in Microsoft security products for hunting and analytics across large volumes of telemetry."
    },
    {
      "term": "Telemetry",
      "definition": "Data generated by systems and applications that can be collected and analyzed to identify malicious or abnormal activity."
    },
    {
      "term": "Detection Rule",
      "definition": "Logic that defines conditions under which security telemetry should trigger an alert."
    },
    {
      "term": "Log Source",
      "definition": "The origin of events or telemetry ingested by detection platforms."
    },
    {
      "term": "Event ID",
      "definition": "A numeric identifier used in many logging systems to categorize the type of event that occurred."
    },
    {
      "term": "Correlation Rule",
      "definition": "Detection logic that links multiple events or conditions to uncover complex attack patterns."
    },
    {
      "term": "Alert",
      "definition": "A notification generated when detection logic identifies activity matching defined criteria."
    },
    {
      "term": "False Positive",
      "definition": "A benign event that incorrectly triggers a security alert."
    },
    {
      "term": "Threat Hunting",
      "definition": "A proactive approach where analysts search through telemetry to identify threats that evaded automated detection."
    },
    {
      "term": "Indicator of Compromise",
      "definition": "An artifact such as a hash, IP address, or domain that suggests potential malicious activity."
    },
    {
      "term": "Baseline",
      "definition": "A reference of normal behavior used to identify anomalies within telemetry data."
    },
    {
      "term": "Behavioral Analytics",
      "definition": "The analysis of user or entity behavior patterns to detect suspicious deviations."
    },
    {
      "term": "Data Normalization",
      "definition": "The process of converting diverse log formats into a consistent schema for analysis."
    },
    {
      "term": "Aggregation",
      "definition": "Combining multiple related events to simplify detection logic and reduce noise."
    },
    {
      "term": "Detection Logic",
      "definition": "The set of conditions and patterns used within rules or queries to detect malicious activity."
    },
    {
      "term": "Detection Coverage",
      "definition": "The breadth of adversary tactics or behaviors monitored by existing detection logic."
    },
    {
      "term": "Suppression",
      "definition": "Filtering or silencing alerts that match specified criteria to minimize noise during analysis."
    },
    {
      "term": "Threshold",
      "definition": "A numeric limit used in detection logic that must be exceeded before an alert is generated."
    },
    {
      "term": "Anomaly Detection",
      "definition": "Identifying patterns in data that do not conform to expected behavior."
    },
    {
      "term": "Log Parsing",
      "definition": "Extracting structured information from raw log entries for analysis."
    },
    {
      "term": "Detection Gap",
      "definition": "A threat scenario or technique that is not covered by existing detection rules or telemetry."
    },
    {
      "term": "Query",
      "definition": "A structured request used to search telemetry data within detection platforms."
    }
  ]
}